Ran Plan for project: `vntechies-gitops` dir: `terraform/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc["demo-vpc"].aws_internet_gateway.igw[0] has been deleted
- resource "aws_internet_gateway" "igw" {
      - id       = "igw-036bd52dc03e6d39d" -> null
        tags     = {
            "Name" = "cloud-day-demo-igw-demo-vpc"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_vpc.vpc has been deleted
- resource "aws_vpc" "vpc" {
      - arn                                  = "arn:aws:ec2:ap-southeast-1:010352592457:vpc/vpc-08b25d848a0ab0547" -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - id                                   = "vpc-08b25d848a0ab0547" -> null
      - owner_id                             = "010352592457" -> null
        tags                                 = {
            "Name"                                              = "cloud-day-demo-vpc-demo-vpc"
            "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
        }
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vpc["demo-vpc"].aws_internet_gateway.igw[0] will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "thodung-vntechies-igw-demo-vpc"
        }
      + tags_all = {
          + "Name"        = "thodung-vntechies-igw-demo-vpc"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route.public_internet_gateway[0] will be created
+ resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc["demo-vpc"].aws_route_table.this["public_rtb"] will be created
+ resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "thodung-vntechies-rtb-demo-vpc-public-rtb"
        }
      + tags_all         = {
          + "Name"        = "thodung-vntechies-rtb-demo-vpc-public-rtb"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_id           = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet1"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet2"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet3"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_security_group.endpoint will be created
+ resource "aws_security_group" "endpoint" {
      + arn                    = (known after apply)
      + description            = "Allow ECR inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "thodung-vntechies-sg-vpce-ap-southeast-1"
        }
      + tags_all               = {
          + "Name"        = "thodung-vntechies-sg-vpce-ap-southeast-1"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet1"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet1-ap-southeast-1a"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet1"         = "ap-southeast-1a"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet1-ap-southeast-1a"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet1"         = "ap-southeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet2"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet2-ap-southeast-1b"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet2"         = "ap-southeast-1b"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet2-ap-southeast-1b"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet2"         = "ap-southeast-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet3"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet3-ap-southeast-1c"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet3-ap-southeast-1c"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "thodung-vntechies-vpc-demo-vpc"
        }
      + tags_all                             = {
          + "Name"        = "thodung-vntechies-vpc-demo-vpc"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
    }

  # module.vpc["demo-vpc"].aws_vpc_endpoint.dynamodb will be created
+ resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
        }
      + tags_all              = {
          + "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_vpc_endpoint.s3 will be created
+ resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
        }
      + tags_all              = {
          + "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1"
          + "component"   = "thodung"
          + "env"         = "vntechies"
          + "github_repo" = "github.com/vntechies/013-demo-gitops"
          + "project"     = "013-demo-gitops"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ subnet_ids = {
      + demo-vpc = {
          + public_subnet1 = (known after apply)
          + public_subnet2 = (known after apply)
          + public_subnet3 = (known after apply)
        }
    }
+ vpc_ids    = {
      + demo-vpc = (known after apply)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vntechies-gitops`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hungran.cloud:4141/lock?id=vntechies%252F013-demo-gitops%252Fterraform%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vntechies-gitops`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 13 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`